Messwerte/Archiv/Raw/apache_benchmark_repeat35/min/default/httpd/target_count_13/repeat_17/3.txt
2020/02/06 23:24:50 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8003/
2020/02/06 23:25:20 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 56634 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8003
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      56634
Failed requests:        0
Total transferred:      16367226 bytes
HTML transferred:       2548530 bytes
Requests per second:    1887.80 [#/sec] (mean)
Time per request:       52.972 [ms] (mean)
Time per request:       0.530 [ms] (mean, across all concurrent requests)
Transfer rate:          532.79 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   40 186.2     11    3059
Processing:     1   12  56.6      6    4437
Waiting:        1   12  56.4      6    4437
Total:          2   53 200.9     17    6487
Percentage of the requests served within a certain time (ms)
  50%     17
  66%     18
  75%     18
  80%     19
  90%     26
  95%     73
  98%   1028
  99%   1039
 100%   6487 (longest request)
2020/02/06 23:25:20 Matched stat line [Connect:        0   40 186.2     11    3059 Connect 0 40 186.2 11 3059]
2020/02/06 23:25:20 Matched stat line [Processing:     1   12  56.6      6    4437 Processing 1 12 56.6 6 4437]
2020/02/06 23:25:20 Matched stat line [Waiting:        1   12  56.4      6    4437 Waiting 1 12 56.4 6 4437]
2020/02/06 23:25:20 Matched stat line [Total:          2   53 200.9     17    6487 Total 2 53 200.9 17 6487]
2020/02/06 23:25:20 Matched percentline [  50%     17 50 17]
2020/02/06 23:25:20 Matched percentline [  66%     18 66 18]
2020/02/06 23:25:20 Matched percentline [  75%     18 75 18]
2020/02/06 23:25:20 Matched percentline [  80%     19 80 19]
2020/02/06 23:25:20 Matched percentline [  90%     26 90 26]
2020/02/06 23:25:20 Matched percentline [  95%     73 95 73]
2020/02/06 23:25:20 Matched percentline [  98%   1028 98 1028]
2020/02/06 23:25:20 Matched percentline [  99%   1039 99 1039]
2020/02/06 23:25:20 Matched percentline [ 100%   6487 100 6487]
{"connect":{"max":3059,"mean":40,"median":11,"min":0,"stdDev":186.1999969482422},"percentiles":{"100":6487,"50":17,"66":18,"75":18,"80":19,"90":26,"95":73,"98":1028,"99":1039},"processing":{"max":4437,"mean":12,"median":6,"min":1,"stdDev":56.599998474121094},"total":{"max":6487,"mean":53,"median":17,"min":2,"stdDev":200.89999389648438},"waiting":{"max":4437,"mean":12,"median":6,"min":1,"stdDev":56.400001525878906}}